export const getFaqItems = () => [
    {
        name: 'Общие вопросы',
        items: [
            {
                title: 'Как оформить заказ на доставку товара из Европы?',
                content:
                    'Свяжитесь с нами любым удобным способом - по телефону, email или через сайт. Опишите желаемый товар, и наши сотрудники подберут для вас лучшие предложения.',
            },
            {
                title: 'Требуется ли предоплата?',
                content:
                    'В большинстве случаев мы работаем без предоплаты - оплата осуществляется после приемки заказа на складе.',
            },
            {
                title: 'Как рассчитывается стоимость доставки?',
                content:
                    'Стоимость зависит от объёма, веса, категории товара, а также страны-поставщика и места назначения. Мы предложим вам оптимальные условия после подтверждения заказа.',
            },
            {
                title: 'Какие товары можно заказать?',
                content:
                    'Мы осуществляем доставку большинства легальных товаров. Если у вас есть сомнения, уточните у наших специалистов - мы проверим возможность доставки.',
            },
            {
                title: 'Как проходит таможенное оформление?',
                content:
                    'Все вопросы, связанные с оформлением документов и таможенной очисткой, мы берём на себя. Вам не придётся заниматься этим самостоятельно.',
            },
            {
                title: 'Можно ли отследить заказ?',
                content:
                    'Да, после оформления отправки по России и СНГ через СДЭК мы предоставим вам трек-номер для отслеживания.',
            },
            {
                title: 'Как оплатить заказ?',
                content:
                    'Оплата производится после прибытия и приемки товара на нашем складе. Возможны разные варианты оплаты по согласованию.',
            },
        ],
    },
];
